export class Constant {
  public PER_PAGINATION = 6;
  // For BS
  public LIST_TYPE_GENERAL_TEXT = [{ id: 'F01', name: 'F01 - GP - วันที่ใบสั่งซื้อ' }, { id: 'F02', name: 'F02 - GP - ใบเสนอราคาเลขที่' }];
  public LIST_TYPE_ITEM_TEXT = [{ id: 'F01', name: 'F01 - ข้อความในรายการ' }, { id: 'F02', name: 'F02 - ข้อความ PO เรคคอร์ดข้อมูบ' }];

  public LIST_TYPE_TAX = [{ id: 'ZVAT', name: 'ภาษีจากการจัดซื้อ(บาท)' }, { id: 'ZVA2', name: 'ภาษีจากการจัดซื้อ(%)' }];
  public LIST_TYPE_PROCUREMENT = [
    { id: 'I', name: 'I - วัสดุคงคลัง - มูลค่า' },
    { id: 'K', name: 'K - ค่าใช้จ่าย' },
    { id: 'S', name: 'S - สินทรัพย์ - บัญชีพัก' }
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL = [{ id: '1', name: 'ขอเบิกเงินในงบประมาณ' }, { id: '2', name: 'ขอเบิกเงินนอกงบประมาณที่ฝากคลัง' }];

  public LIST_TYPE_REQUEST_WITHDRAWAL_KB02 = [
    { id: '1', name: 'เพื่อจ่ายผู้ขาย/สัญญา' },
    { id: '2', name: 'เพื่อชดใช้ใบสำคัญ' },
    { id: '3', name: 'เพื่อจ่ายเงินเดือนและเงินอื่นที่จ่ายสิ้นเดือน' },
    { id: '4', name: 'เพื่อจ่ายให้ยืม' },
    { id: '5', name: 'รายการขอเบิกเงินอุดหนุน' }
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB05 = [
    { id: '1', name: '	รายการขอถอนคืนรายได้แผ่นดิน' },
  ];
  public LIST_PAYMENT_KB05 = [
    { id: '2', name: '	จ่ายผ่านบัญชีเงินฝากธนาคารของหน่วยงาน' }
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB06 = [
    { id: '1', name: '		รายการขอถอนคืนรายได้เงินนอกงบประมาณ' },
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB08 = [
    { id: '1', name: '		รายการขอถอนคืนรายได้เงินนอกงบประมาณ' },
  ];
  public LIST_PAYMENT_KB08 = [
    { id: '1', name: '		จ่ายตรงเข้าบัญชีเงินฝากธนาคารของผู้ขาย/คู่สัญญา' },
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB09 = [
    { id: '1', name: '			รายการถอนคืนรายได้แผ่นดินผ่านระบบ BAHTNET' },
  ];
  public LIST_PAYMENT_KB09 = [
    { id: '1', name: '			จ่ายตรงผู้ขายที่เป็นสรก.ในงบ' },
  ];
  public LIST_TYPE_REQUEST_WITHDRAWAL_KB10 = [
    { id: '1', name: '				รายการถอนเงินจัดสรรให้ อปท. ผ่านระบบ BAHTNET' },
  ];
  public LIST_PAYMENT_KB10 = [
    { id: '1', name: '				จ่ายตรงผู้ขายที่เป็นสรก. นอกงบ' },
  ];
  public LIST_TYPE_RECEIVE_MONEY_NS01 = [
    { id: 'RA', name: 'RA - รายได้แผ่นดิน' },
    { id: 'RB', name: 'RB - เงินฝากคลัง' },
  ];
  public LIST_TYPE_SEARCH_RECEIVE_MONEY_NS01 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'RA', name: 'RA - รายได้แผ่นดิน' },
    { id: 'RB', name: 'RB - เงินฝากคลัง' },
  ];
  public LIST_TYPE_MONEY_NS01 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำฝากคลัง' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำฝากคลัง' },
  ];
  public LIST_TYPE_RECEIVE_MONEY_NS03 = [
    { id: 'RC', name: 'RC - รายได้แผ่นดินแทนกัน' },
    { id: 'RD', name: 'RD - เงินฝากคลังแทนกัน' },
  ];
  public LIST_TYPE_SEARCH_RECEIVE_MONEY_NS03 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'RC', name: 'RC - รายได้แผ่นดินแทนกัน' },
    { id: 'RD', name: 'RD - เงินฝากคลังแทนกัน' },
  ];
  public LIST_TYPE_MONEY_NS03 = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำฝากคลัง' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำฝากคลัง' },
  ];
  public LIST_TYPE_DEPOSIT_MONEY_NS021 = [
    { id: 'R1', name: 'R1 - รายได้แผ่นดินของตนเอง' },
    { id: 'R2', name: 'R2 - เงินฝากคลังของตนเอง' },
  ];

  public LIST_PROCUREMENT = [
    { id: '01', name: '01 - วิธีตกลงราคา' },
    { id: '02', name: '02 - วิธีสอบราคา' },
    { id: '03', name: '03 - วิธีประกวดราคา' },
    { id: '04', name: '04 - วิธีพิเศษ' },
    { id: '05', name: '05 - วิธีกรณีพิเศษ' },
    { id: '06', name: '06 - e-AUCTION' },
    { id: '07', name: '07 - วิธีตกลง' },
    { id: '08', name: '08 - วิธีคัดเลือก' },
    { id: '09', name: '09 - วิธีคัดเลือกแบบจำกัดข้อกำหนด' },
    { id: '13', name: '13 - วิธีพิเศษเลือกจ้าง' },
    { id: '14', name: '14 - วิธีพิเศษประกวดแบบ' },
    { id: '15', name: '15 - e-market' },
    { id: '16', name: '16 - e-bidding' },
    { id: '18', name: '18 - คัดเลือก' },
    { id: '19', name: '19 - เฉพาะเจาะจง' },
    { id: '20', name: '20 - จ้างที่ปรึกษาวิธีประกาศเชิญชวน' },
    { id: '21', name: '21 - จ้างที่ปรึกษาวิธีคัดเลือก' },
    { id: '22', name: '22 - จ้างที่ปรึกษาวิธีเฉพาะเจาะจง' },
    { id: '23', name: '23 - จ้างออกแบบฯ วิธีประกาศเชิญชวน' },
    { id: '24', name: '24 - จ้างออกแบบฯ วิธีคัดเลือก' },
    { id: '25', name: '25 - จ้างออกแบบฯ วิธีเฉพาะเจาะจง' },
    { id: '26', name: '26 - จ้างออกแบบฯ วิธีประกวดแบบ' },
    { id: '99', name: '99 - ไม่เข้าข่ายจัดซื้อฯตามระเบียบฯ' }
  ];
  public TYPE_TAX_LIST = [{ id: '0: 1', name: 'ภาษีจากการจัดซื้อ(บาท)' }, { id: '1: 2', name: 'ภาษีจากการจัดซื้อ(%)' }];

  public DOCUMENT_TYPE = [
    { id: '0: 1', name: 'CF - กันเงินเหลื่อมปี - ไม่มีหนี้ผูกพัน' },
    { id: '1: 2', name: 'CK - กันเงินเหลื่อมปี - เสมือนมีหนี้ผูกพัน' },
    { id: '2: 3', name: 'CX - กันเงินเหลื่อมปี - มีหนี้ผูกพัน' },
    { id: '3: 4', name: 'CZ - กันเงิน - เงินเหลือจ่าย' }
  ];

  public LIST_UNIT_FOR_ORDER = [{ id: 'EA', name: 'EA - ชิ้น' }, { id: 'EB', name: 'EB - อัน' }];

  public LIST_REASON_CANCEL_ORDER = [
    { id: '', name: '---- กรุณาระบุเหตุผลในการยกเบิก ----' },
    { id: '0001', name: '0001 - แก้ไขปริมาณ' },
    { id: '0002', name: '0002 - แก้ไขราคา' },
    { id: '0003', name: '0003 - แก้ไขทั้งปริมาณและราคา' },
    { id: '0004', name: '0004 - แก้ไขกำหนดส่งมอบ' },
    { id: '0005', name: '0005 - ลบรายการเนื่องจากคีย์ข้อมูลผิด' },
    { id: '0006', name: '0006 - ยกเลิกรายการสั่งซื้อบางรายการ' },
    { id: '0007', name: '0007 - ยกเลิกการสั่งซื้อ/จ้างทั้งใบ' },
    { id: '0008', name: '0008 - ยกเลิกสัญญาเพราะผู้ขายทิ้งงาน' },
    { id: '9999', name: '9999 - อื่นๆ' }
  ];
  public LIST_REASON_BACK_LIST = [
    { id: '', name: '---- กรุณาระบุเหตุผลในการกลับรายการ ----' },
    { id: '01', name: '01 - การกลับรายการเนื่องจากรหัสบัญชีผิด' },
    { id: '02', name: '02 - การกลับรายการเนื่องจากจำนวนเงินผิด' },
    { id: '03', name: '03 - การกลับรายการเนื่องจากรหัสอื่นๆผิด' },
    { id: '04', name: '04 - การกลับรายการเนื่องจากผิดจากหลายสาเหตุ' },
    { id: '05', name: '05 - การกลับรายการค้างรับค้างจ่าย' },
    { id: '06', name: '06 - การกลับรายการเมื่อปิดงวด' },
    { id: '07', name: '07 - การกลับรายการขอเบิกที่ไม่ผ่านการอนุมัติ' }
  ];

  public LIST_YEAR = [];
  public LIST_ROUND = [{ id: '1', name: 'กันยายน' }, { id: '2', name: 'มีนาคม' }];

  public LIST_TYPE_SEARCH_CONDITION = [
    { id: '1', name: 'วันที่บันทึกรายการ' },
    { id: '2', name: 'วันที่ผ่านรายการ' },
    { id: '3', name: 'วันที่เอกสาร' }
  ];
  public LIST_TYPE_SEARCH_CONDITION_BS = [{ id: '1', name: 'วันที่บันทึกรายการ' }, { id: '2', name: 'วันที่ใบสั่งซื้อ/สัญญา' }];

  public LIST_TYPE_SEARCH_CONDITION_SNG = [
    { id: 'ED', name: 'วันที่บันทึกรายการ' },
    { id: 'PD', name: 'วันที่ผ่านรายการ' },
    { id: 'DD', name: 'วันที่เอกสาร' }
  ];

  public LIST_TYPE_DOCUMENT = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'J4', name: 'J4 - โอนทรัพย์สิน interface ภายในกรม' },
    { id: 'J5', name: 'J5 - โอนทรัพย์สิน interface ข้ามกรม' },
    { id: 'J6', name: 'J6 - โอนวัสดุคงคลังข้ามกรม' },
    { id: 'N1', name: 'N1 - เบิกหักผลักส่งเงินงบประมาณเป็นเงินฝากคลังของทุนหมุนเวียน' },
    { id: 'RI', name: 'RI - โอนขายบิลภายในกรมเดียวกัน (รายได้)' },
    { id: 'RJ', name: 'RJ - โอนขายบินข้ามกรม (รายได้)' },
    { id: 'RK', name: 'RK - โอนขายบิลภายในกรมเดียวกัน (หนีสิ้น)' },
    { id: 'RL', name: 'RL - โอนขายบินข้ามกรม (หนีสิ้น)' },
    { id: 'RM', name: 'RM - โอนขายบิลจากทุนหมุนเวียนไปหน่วยงานในส่วนภูมิภาค' },
    { id: 'RN', name: 'RN - โอนขายบิลจากหน่วยงานในส่วนภูมิภาคให้ทุนหมุนเวียนเป็นเงินฝากกองคลังหน่วยงานภาครัฐ' },
    { id: 'RO', name: 'RO - โอนขายบิลจากหน่วยงานในส่วนภูมิภาคให้ทุนหมุนเวียนเป็นรายได้' },
    { id: 'SQ', name: 'SQ - บันทึกปรับปรุงบัญชีรายได้แผ่นดิรอนำส่งคลัง' }
  ];

  public LIST_AREA_CODE = [{ id: 'P1000', name: 'P1000 ส่วนกลาง' }];
  public LIST_TYPE_DOCUMENT_BC011 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'JM', name: 'JM - บันทึกปรับปรุงบัญชีวัสดุคงคลัง' },
    { id: 'JR', name: 'JR - บันทึกรายการบัญชีเงินสดและเทียบเท่าเงินสด' },
    { id: 'JV', name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด' },
    { id: 'N3', name: 'N3 - บันทึกเบิกหักผลักส่งเงินฝากคลังเป็นรายได้แผ่นดิน' },
    { id: 'PP', name: 'PP - บันทึกจ่ายเงินฝากธนาคารพาณิชย์' },
    { id: 'RE', name: 'RE - บันทึกรับเงินฝากธนาคาร' }
  ];
  public LIST_TYPE_DOCUMENT_BC011s = [
    { id: '', name: '---- ไม่กำหนด ----' },

    { id: 'JR', name: 'JR - บันทึกรายการบัญชีเงินสดและเทียบเท่าเงินสด' },
    { id: 'JV', name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด' }
  ];
  public LIST_TYPE_DOCUMENT_BC021 = [{ id: 'SW', name: 'SW - บันทึกปรับปรุงรายการบัญชีค้างรับ/ค้างจ่าย' }];
  public LIST_TYPE_DOCUMENT_BC013 = [{ id: 'JF', name: 'JF - รับย้ายจ่ายย้าย' }];
  public LIST_TYPE_DOCUMENT_BC20 = [{ id: 'JN', name: 'JN - ปรับปรุงเช็คขัดข้อง' }];
  public LIST_TYPE_DOCUMENT_BC21 = [{ id: 'RR', name: 'RR - รับแทนเช็คขัดข้อง' }];
  public LIST_TYPE_DOCUMENT_TEST = [{ id: 'JY', name: 'JY - เอกสารนำเข้างบทดลอง' }];

  public LIST_TYPE_DOCUMENT_ST131 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'AA', name: 'AA - ผ่านรายการสินทรัพย์' },
    { id: 'JV', name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด' },
    { id: 'JJ', name: 'JJ - การผ่านรายการหักล้าง' }
  ];
  public LIST_TYPE_DOCUMENT_BC01A1 = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'BD', name: 'BD - เบิกเกินส่งคืน' },
    { id: 'BE', name: 'BE - คืนงบในปี' },
    { id: 'BF', name: 'BF - คืนงบข้ามปี' },
    { id: 'BT', name: 'BT - เบิกเกินส่งคืน TKK' },
    { id: 'G1', name: 'G4 - ล้างบัญชีเงินทดรองราชการ/ค่าใช้จ่ายจ่ายล่วงหน้า' },
    { id: 'JV', name: 'JV - บันทึกรายการบัญชีทั่วไปไม่เกี่ยวกับเงินสดและเทียบเท่าเงินสด' }
  ];
  public LIST_PK = [{ id: '40', name: 'เดบิต' }, { id: '50', name: 'เครดิต' }];

  public SEARCH_DOC_NUMBER = ' ค้นหาตามเลขที่เอกสาร';
  public SEARCH_ETC_CONDITION = ' ค้นหาตามเงื่อนไขอื่น';

  public BUTTON = {
    create: 'สร้าง',
    edit: 'แก้ไข',
    cancel: 'ยกเลิก',
    search: 'ค้นหา',
    begin_search: 'เริ่มค้นหา',
    back_list: 'กลับรายการ',
    tax_input: 'ระบุภาษีมูลค่าเพิ่ม',
    advance_payment: 'ระบุค่าเงินจ่ายล่วงหน้า',
    addition_general_info: 'ระบุข้อความเพิ่มเติมสำหรับข้อมูลทั่วไป'
  };
  public FORM = {
    order_number: 'เลขที่ใบสั่งซื้อ/สัญญา',
    procurement_choice: 'วิธีการจัดซื้อจัดจ้าง',
    tax_id: 'รหัสประจำตัวผู้เสียภาษี',
    bank_number: 'เลขที่บัญชีเงินฝากธนาคาร',
    start_date_order: 'วันที่ใบสั่งซื้อ/สัญญา',
    end_date_order: 'วันที่สิ้นสุดสัญญา'
  };

  // month
  public monthTh = {
    8: 'ก.ย.'
  };

  // header dialog-search
  public HEADER_DIALOG_SEARCH = {
    typeAccountCode: ['เลือก', 'รหัสบัญชีแยกประเภท', 'ชื่อ', 'คำอธิบาย'],
    centerCode: ['เลือก', 'รหัสศูนย์ต้นทุน', 'ชื่อ', 'คำอธิบาย', 'รหัสหน่วยงาน', 'หน่วยเบิกจ่าย', 'รหัสจังหวัด'],
    areaCode: ['เลือก', 'รหัสพื้นที่', 'ชื่อ', 'คำอธิบาย'],
    sourceMoneyCode: ['เลือก', 'แหล่งของเงิน', 'ชื่อ', 'คำอธิบาย'],
    sourceBudgetCode: ['เลือก', 'รหัสงบประมาณ', 'คำอธิบาย'],
    mainActivityCode: ['เลือก', 'กิจกรรมหลัก', 'ชื่อของเขตฟังก์ชั่น', 'คำอธิบาย'],
    subActivityCode: ['เลือก', 'กิจกรรมย่อย', 'ชื่อทั่วไป', 'ข้อความแบบยาว', 'รหัสหน่วยงาน'],
    subAccountCode: ['เลือก', 'เจ้าของบัญชีย่อย', 'บัญชีย่อย', 'คำอธิบาย', 'ประเภท/หมวด'],
    packageCode: ['เลือก', 'รหัสหมวดพัสดุ', 'ชื่อ'],
    bankBranch: ['เลือก', 'รหัสธนาคาร', 'ชื่อ', 'แผนงบประมาณ', 'ถนน', 'สาขาธนาคาร'],
    depositAccount: ['เลือก', 'บัญชีเงินฝาก', 'ชื่อบัญชี', 'เจ้าของบัญชีเงินฝาก', 'ประเภท/หมวด'],
    gpscCode: ['เลือก', 'GPSC', 'คำอธิบาย GPSC', 'กลุ่มวัสดุ'],
    vendorTaxId: ['เลือก', 'รหัสประจำตัวผู้เสียภาษี', 'รหัสผู้ขาย', 'ชื่อผู้ขาย'],
    vendorBankAccount: [
      'เลือก',
      'เลขที่บัญชีเงินฝากธนาคาร',
      'Key ธนาคาร',
      'ลำดับที่',
      'รหัสผู้ขาย',
      'รหัสประจำตัวผู้เสียภาษี(ผู้ขาย)',
      'ชื่อผู้ขาย',
      'Block'
    ],
    assetCode: ['เลือก', 'หมวดสินทรัพย์', 'ชื่อหมวดสินทรัพย์-ข้อความแบบย่อ', 'คำอธบายของการกำหนดบัญชี'],
    unit: ['เลือก', 'หน่วยนับ', 'ข้อความหน่วยนับ(ไม่เกิน 10 ตัวอักษร)'],
    incomeCode: ['เลือก', 'รหัสรายได้', 'ชื่อรายได้', 'คำอธิบาย'],
    bankBook: ['เลือก', 'รหัสบัญชีธนาคารย่อย (Book Bank)', 'ชื่อ', 'คำอธิบาย']
  };

  public LIST_STATUS = [{ id: '', name: '---- ไม่กำหนด ----' }, { id: 'Y', name: 'อนุมัติ' }, { id: 'N', name: 'ไม่อนุมัติ' }];

  public LABEL_CLASS = {
    disable: 'text-black',
    green: 'text-underline-green',
    required: 'text-underline-red',
    blue: 'text-underline-blue'
  };

  public FORM_ID_KB = {
    kb01: 'E01',
    kb02: 'E02',
    kb03: 'E03',
    kb04: '',
    kb05: 'E06',
    kb06: 'E07',
    kb07: '',
    kb08: 'E15',
    kb09: 'E16',
    kb10: 'E17',
    kb11: 'E08',
    kb21: 'E01',
    kb22: 'E01'
  };
  public FORM_ID_BC = {
    bc01: 'J00',
    bc01a: 'J30',
    bc01s: 'J01',
    bc02: 'J03',
    bc03: '',
    bc04: 'J04',
    bc05: 'J05',
    bc06: '',
    bc07: '',
    bc08: 'J08',
    bc09: '',
    bc10: 'J10',
    bc11: 'J11',
    bc12: 'J12',
    bc13: 'J13',
    bc14: 'J14',
    bc15: '',
    bc16: '',
    bc17: '',
    bc18: '',
    bc19: '',
    bc20: 'J20',
    bc21: 'J21',
    bc22: 'J22'
  };
  public FORM_ID_ST = {
    st01: 'S01',
    st11: 'S11'
  };
  public FORM_ID_NS = {
    ns01: 'R01',
    ns021: 'R04',
    ns022: 'R05',
    ns03: 'R00',
    ns041: 'R06',
    ns042: 'R07',
    // ns021:'R34',
    // ns021:'R35',

  };


  public FORM_ID_OM = {
    om01: 'Z01',
    om02: 'Z02',
    om03: 'Z03'
  };
  public FORM_ID_BS = {
    bs01: 'P01',
    bs01a: '',
    bs01s: '',
    bs02: '',
    bs03: '',
    bs04: 'P04',
    bs05: '',
    bs06: 'P05'
  };
  public FORM_ID_PK = {
    pk01: 'V01'
  };
  public FORM_ID_SNG = {
    sng01: 'F01',
    sng02: 'F08',
    sng03: 'F05'
  };
  public FORM_ID_OP = {
    op01: 'F06'
  };
  public FORM_ID_TK = {
    tk01: 'E13',
    tk11: 'E11'
  };

  // mock doctype wait for service
  public LIST_DOC_TYPE_OM = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: 'AA', name: 'AA - ผ่านรายการสินทรัพย์' },
    { id: 'AF', name: 'AF - ผ่านรายการค่าเสื่อมฯ' },
    { id: 'AI', name: 'AI - สินทรัพย์ Interfaced' },
    { id: 'AN', name: 'AN - ผ่านสินทรัพย์สุทธิ' },
    { id: 'AO', name: 'AO - สินทรัพย์เก่า' },
    { id: 'AT', name: 'AT - ผ่านรายการสินทรัพย์' },
    { id: 'AZ', name: 'AZ - กลับรายการสินทรัพย์' },
    { id: 'B7', name: 'B7 - ปรับปรุงงบพลาง49to50' }
  ];
  public LIST_PAYMENT_KB02 = [
    { id: '1', name: '	จ่ายตรงเข้าบัญชีเงินฝากธนาคารของผู้ขาย/คู่สัญญา  ' },
    { id: '2', name: '	จ่ายผ่านบัญชีเงินฝากธนาคารของหน่วยงาน' }
  ];
  public LIST_PAYMENT_OM = [
    { id: '', name: '---- ไม่กำหนด ----' },
    { id: '0', name: '0 - จ่ายตรงจากแหล่งเงินกู้ นอก TR1' },
    { id: '1', name: '1 - จ่ายตรงผู้ขาย เงินงบประมาณ' },
    { id: '2', name: '2 - จ่ายเงินในงบให้Agency-Indirect	' },
    { id: '3', name: '3 - จ่ายตรงผู้ขายเงินนอกงบประมาณ' },
    { id: '4', name: '4 - จ่ายเงินนอกงบให้Agency-Indirec' },
    { id: '5', name: '5 - จ่ายเงินนอกงปม. นอก TR1	' },
    { id: '6', name: '6 - จ่ายสำรองค.กเงินกู้ตปท.-Direct' },
    { id: '7', name: '7 - จ่ายสำรองค.ก.เงินกู้ตปท.-Indir' },
    { id: '8', name: '8 - จ่ายชำระเงินกู้ ในงบ Direct' },
    { id: '9', name: '9 - จ่ายชำระเงินกู้ ในงบ InDirect' }
  ];

  public LIST_TYPE_GROUP_SELLER = [
    { id: '', name: '------ เลือกประเภทกลุ่มผู้ขาย ------' },
    { id: '1000', name: '1000 - ผู้ขายทั่วไป(นิติบุคคล-บริษัท)' },
    { id: '2000', name: '2000 - กลุ่มผุ้ขายทั่วไป(บุคคลธรรมดา)' },
    { id: '6000', name: '6000 - กลุ่มเจ้าหนี้ต่างประเทศ' }
  ];

  // ประเภทการรับเงิน นส01
  public RECEIVING_TYPE_FUND_NS01 = [{ id: 'RA', name: 'RA - รายได้แผ่นดิน' }, { id: 'RB', name: 'RB - เงินฝากคลัง' }];

  // ประเภทการรับเงิน นส03
  public RECEIVING_TYPE_FUND_NS03 = [{ id: 'RC', name: 'RC - รายได้แผ่นดินแทนกัน' }, { id: 'RD', name: 'RD - เงินฝากคลังแทนกัน' }];

  // ประเภทเงิน
  public FUND_TYPE = [
    { id: '1101010101', name: 'กรณีเงินสด/เช็คผลประโยชน์' },
    { id: '1101020601', name: 'กรณีเงินฝากธนาคารเพื่อนำส่งคลัง' },
    { id: '1101020606', name: 'กรณีเงินฝากธนาคารรายบัญชีเพื่อนำส่งคลัง' }
  ];

  // pk approveStatus
  public STATUS_APPROVE = {
    0: 'Wait for approve',
    1: 'Approved'
  };

  public STATUS_CONFIRM = {
    0: 'ไม่มี Vendor สำหรับกรมนี้',
    1: '-'
  };

  public LIST_OF_TYPE_DOCUMENT_SNG = [
    // { id: 'AV', name: 'สำรองเงินทุน ลูกหนี้เงินยืม' },
    // { id: 'CB', name: 'กรณีค้างเบิกข้ามปี' },
    // { id: 'CC', name: 'โอนงบกลางเหลื่อมปี' },
    { id: 'CF', name: 'กันเงินเหลื่อมปี-ไม่มีหนี้ผูกพัน' },
    // { id: 'CG', name: 'กรณีย้ายหน่วยเบิกจ่าย' },
    { id: 'CK', name: 'กันเงินเหลื่อมปี-เสมือนมีหนี้ผูกพัน' },
    // { id: 'CM', name: 'กันเงิน-เงินลอย มีค.' },
    // { id: 'CO', name: 'กันเงินเหลื่มปี CONVERSION' },
    // { id: 'CP', name: 'สำหรับอ้างสร้าง PO ใหม่' },
    // { id: 'CS', name: 'กันเงิน-เงินลอย กย.' },
    { id: 'CX', name: 'กันเงินเหลื่อมปี-มีหนี้ผูกพัน' },
    { id: 'CZ', name: 'กันเงิน-เงินเหลือจ่าย' },
    { id: 'PF', name: 'งบประมาณที่ผูกพันแล้ว' }
    // { id: 'SA', name: 'การเบิกแทนกัน' },
    // { id: 'SB', name: 'การเบิกแทนกันเหลื่อมปี' },
    // { id: 'SC', name: 'กันเงินเหลื่มปีไม่มีหนี้' }
  ];

  public LIST_OF_TYPE_DOCUMENT_SNG_SEARCH = [
    { id: '', name: '---- ไม่กำหนด ----' },
    // { id: 'AV', name: 'สำรองเงินทุน ลูกหนี้เงินยืม' },
    // { id: 'CB', name: 'กรณีค้างเบิกข้ามปี' },
    // { id: 'CC', name: 'โอนงบกลางเหลื่อมปี' },
    { id: 'CF', name: 'กันเงินเหลื่อมปี-ไม่มีหนี้ผูกพัน' },
    // { id: 'CG', name: 'กรณีย้ายหน่วยเบิกจ่าย' },
    { id: 'CK', name: 'กันเงินเหลื่อมปี-เสมือนมีหนี้ผูกพัน' },
    // { id: 'CM', name: 'กันเงิน-เงินลอย มีค.' },
    // { id: 'CO', name: 'กันเงินเหลื่มปี CONVERSION' },
    // { id: 'CP', name: 'สำหรับอ้างสร้าง PO ใหม่' },
    // { id: 'CS', name: 'กันเงิน-เงินลอย กย.' },
    { id: 'CX', name: 'กันเงินเหลื่อมปี-มีหนี้ผูกพัน' },
    { id: 'CZ', name: 'กันเงิน-เงินเหลือจ่าย' }
    // { id: 'PF', name: 'งบประมาณที่ผูกพันแล้ว' },
    // { id: 'SA', name: 'การเบิกแทนกัน' },
    // { id: 'SB', name: 'การเบิกแทนกันเหลื่อมปี' },
    // { id: 'SC', name: 'กันเงินเหลื่มปีไม่มีหนี้' }
  ];

  public LIST_REASON_SNG = [
    { id: '', name: '------ ไม่กำหนด ------' },
    { id: '2001', name: '- การจัดสรรงปม./พรก.เงินกู้ ของส่วนราชการไปยังส่วนราชการระดับหน่วยเบิกจ่าย' },
    { id: '2002', name: '- การโอนเงินเหลือจ่าย TKK 2555' },
    { id: '2003', name: '- การโอนเงินเหลือจ่าย/พรก.เงินกู้' },
    { id: '2101', name: '- การจัดสรรหรือการโอนงปม./พรก.เงินกู้ ของส่วนราชการไปยังระดับกอง' },
    { id: '2102', name: '- การโอนเงินเหลือจ่าย/พรก.เงินกู้ ระดับกอง' },
    { id: '2103', name: '- การโอนเงินเหลือจ่าย/พรก.เงินกู้ ระดับกอง' },
    { id: '3001', name: '- การปรับเปลี่ยนงปม.ที่เป็นไปตามระเบียบว่าด้วยการบริหารงปม. พ.ศ. 2548' },
    { id: '3002', name: '- การปรับเปลี่การโอน/เปลี่ยนแปลงงบประมาณเหลือจ่ายที่ได้ดำเนินงานบรรลุวัตถุประสงค์แล้ว (ชำระค่าสาธารณูปโภคแล้ว)' },
    { id: '3003', name: '- การปรับเปลี่ยนงปม.ภายใต้แผนงานเดียวกัน ไปเพิ่มในงบบุคลากร ไม่เป็นการกำหนดอัตราตั้งใหม่' },
    {
      id: '3004',
      name:
        'การปรับเปลี่ยนงปม.ภายใต้แผนงานเดียวกัน โดยงปม.ที่ได้รับจัดสรรไม่สามารถจัดหาได้ โดยเพิ่มวงเงินรายการครุภัณฑ์สิ่งก่อสร้างไม่เกินร้อยละสิบของวงเงินที่ได้รับจัดสรร'
    },
    { id: '3101', name: 'การจัดสรรหรือการโอนงปม. ของส่วนราชการไปยังระดับกอง (จากการโอน  3000)' },
    { id: '6001', name: 'การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม' },
    { id: '6002', name: 'การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม' },
    { id: '6101', name: 'การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม' },
    { id: '6102', name: 'การปรับเปลี่ยนงปม.งบกลางของส่วนราชการ ที่นำความตามระเบียบว่าด้วยกาบริหารงบประมาณ พศ.2546 มาบังคับใช้โดยอนุโลม' }
  ];

  // report
  public REPORT_TAIL_HEAD = [
    {
      id: 'pk01',
      title: 'รายงานขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ (ขบ. 01)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ',
      formId: 'V01'
    },
    { id: 'bs01', title: 'สั่งซื้อ/จ้าง/เช่า (บส. 01)', description: 'ค้นหารายงานสั่งซื้อ/จ้าง/เช่า', formId: 'P01' },
    {
      id: 'bs04',
      title: 'สั่งซื้อ/จ้าง/เช่า ประเภทการส่งมอบไม่แน่นอน (บส. 04)',
      description: 'ค้นหารายงานสั่งซื้อ/จ้าง/เช่า ประเภทการส่งมอบไม่แน่นอน',
      formId: 'P04'
    },
    { id: 'br01', title: 'ตรวจรับพัสดุ (บร. 01)', description: 'ค้นหารายงานตรวจรับพัสดุ', formId: 'G01' },
    {
      id: 'kb01',
      title: 'ขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ (ขบ. 01)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่อ้างใบสั่งซื้อฯ',
      formId: 'E01'
    },
    {
      id: 'kb02',
      title: 'ขอเบิกเงินงบประมาณที่ไม่อ้างใบสั่งซื้อฯ (ขบ. 02)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่ไม่อ้างใบสั่งซื้อฯ',
      formId: 'E02'
    },
    {
      id: 'kb03',
      title: 'ขอเบิกเงินนอกงบประมาณที่ไม่อ้างใบสั่งซื้อฯ (ขบ. 03)',
      description: 'ค้นหารายงานขอเบิกเงินนอกงบประมาณที่ไม่อ้างใบสั่งซื้อฯ',
      formId: 'E03'
    },
    { id: 'kb05', title: 'ขอถอนคืนรายได้แผ่นดิน (ขบ. 05)', description: 'ค้นหารายงานขอถอนคืนรายได้แผ่นดิน', formId: 'E06' },
    { id: 'kb06', title: 'ขอถอนคืนรายได้เงินนอกงบประมาณ (ขบ. 06)', description: 'ค้นหารายงานขอถอนคืนรายได้เงินนอกงบประมาณ', formId: 'E07' },
    { id: 'kb08', title: 'ขอเบิกเงินรายได้จัดสรร (ขบ. 08)', description: 'ค้นหารายงานขอเบิกเงินรายได้จัดสรร', formId: 'E15' },
    {
      id: 'kb09',
      title: 'ขอถอนคืนรายได้แผ่นดินผ่านระบบ BAHTNET (ขบ. 09)',
      description: 'ค้นหารายงานขอถอนคืนรายได้แผ่นดินผ่านระบบ BAHTNET',
      formId: 'E16'
    },
    {
      id: 'kb10',
      title: 'ขอถอนเงินจัดสรรให้ อปท. ผ่านระบบ BAHTNET (ขบ. 10)',
      description: 'ค้นหารายงานขอถอนเงินจัดสรรให้ อปท. ผ่านระบบ BAHTNET',
      formId: 'E17'
    },
    {
      id: 'kb11',
      title: 'ขอเบิกเงินงบประมาณที่ต้องอ้างใบสั่งซื้อฯ การส่งมอบไม่แน่นอน (ขบ. 11)',
      description: 'ค้นหารายงานขอเบิกเงินงบประมาณที่ต้องอ้างใบสั่งซื้อฯ การส่งมอบไม่แน่นอน',
      formId: 'E08'
    },
    {
      id: 'tk01',
      title: 'ขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ (ทข. 01)',
      description: 'ค้นหารายงานขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ',
      formId: 'E13'
    },
    { id: 'tk02', title: '-', description: 'ค้นหารายงาน', formId: 'E14' },
    {
      id: 'tk11',
      title: 'ขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ การส่งมอบไม่แน่นอน (ทข. 11)',
      description: 'ค้นหารายงานขอเบิกเงินกู้อ้างอิงใบสั่งซื้อฯ การส่งมอบไม่แน่นอน',
      formId: 'E11'
    },
    { id: 'kj05', title: '-', description: 'ค้นหารายงาน', formId: '' },
    { id: 'bc01', title: 'บันทึกรายการบัญชีแยกประเภท (บช.01)', description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี', formId: 'J00' },
    { id: 'bc01s', title: 'บันทึกรายการบัญชีแยกประเภท (บช.01-2)', description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี', formId: '' },
    {
      id: 'bc02',
      title: 'บันทึกรายการปรับปรุงบัญชีค้างรับ-ค้างจ่าย (บช. 02)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: 'J03'
    },
    {
      id: 'bc04',
      title: 'บันทึกรายการบัญชี สำหรับเอกสารที่พักไว้ (บช. 04)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี',
      formId: 'J04'
    },
    {
      id: 'bc05',
      title: 'งบทดลอง - หน่วยงานอิสระและองค์กรมหาชน (บช. 05)',
      description: 'ค้นหารายงานงบทดลอง - หน่วยงานอิสระและองค์กรมหาชน',
      formId: 'J05'
    },
    { id: 'bc07', title: '-', description: 'ค้นหารายงาน', formId: '' },
    { id: 'bc08', title: 'งบทดลอง - หน่วยงานต่างประเทศ (บช. 08)', description: 'ค้นหารายงานงบทดลอง - หน่วยงานต่างประเทศ', formId: 'J08' },
    {
      id: 'bc10',
      title: 'งบทดลอง - หน่วยงานอิสระและองค์กรมหาชน (บช. 05)',
      description: 'ค้นหารายงานงบทดลอง - หน่วยงานอิสระและองค์กรมหาชน',
      formId: 'J10'
    },
    {
      id: 'bc11',
      title: 'งบทดลอง - เงินนอกงบประมาณของส่วนราชการ (บช. 11)',
      description: 'ค้นหารายงานงบทดลอง - สร้างงบทดลอง - เงินนอกงบประมาณของส่วนราชการ',
      formId: 'J11'
    },
    {
      id: 'bc12',
      title: 'บันทึกรายการจ่ายย้ายเงินคงคลัง (บช. 12)',
      description: 'ค้นหารายงานเอกสารรายการจ่ายย้ายเงินคงคลัง',
      formId: 'J12'
    },
    {
      id: 'bc13',
      title: 'บันทึกรายการจ่ายย้ายเงินคงคลัง (บช. 12)',
      description: 'ค้นหารายงานเอกสารรายการจ่ายย้ายเงินคงคลัง',
      formId: 'J13'
    },
    {
      id: 'bc14',
      title: 'บันทึกรายการการจ่ายแลกเหรียญกษาปณ์เงินคงคลัง (บช. 14)',
      description: 'ค้นหารายงานเอกสารรายการจ่ายแลกเหรียญกษาปณ์เงินคงคลัง',
      formId: 'J14'
    },
    { id: 'bc04', title: '', description: 'ค้นหารายงาน', formId: '' },
    { id: 'bc20', title: 'บันทึกรายการตั้งลูกหนี้เช็คขัดข้อง (บช. 20)', description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี', formId: 'J20' },
    { id: 'bc21', title: 'บันทึกรายการลดลูกหนี้เช็คขัดข้อง (บช. 21)', description: 'ค้นหารายงานเอกสารบันทึกรายการบัญชี', formId: 'J21' },
    {
      id: 'bc22',
      title: 'บันทึกรายการปรับปรุงบัญชีบัตรภาษี (บช. 22)',
      description: 'ค้นหารายงานเอกสารบันทึกรายการปรับปรุงบัญชี',
      formId: 'J22'
    },
    {
      id: 'ns021a',
      title: 'นำส่งเงินแบบผ่านรายการ (นส. 02-1)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารผ่านรายการ',
      formId: ''
    },
    {
      id: 'ns022a',
      title: 'นำส่งเงินแบบพักรายการ (นส. 02-2)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารพักรายการ',
      formId: ''
    },
    { id: 'ns01', title: 'การรับเงินของหน่วยงาน (นส. 01)', description: 'ค้นหารายงานการรับเงินของหน่วยงาน', formId: '' },
    { id: 'ns03', title: 'การรับเงินแทนกัน (นส. 03)', description: 'ค้นหารายงานข้อมูลการรับเงินแทนกัน', formId: '' },
    {
      id: 'ns021',
      title: 'นำส่งเงินแบบผ่านรายการ (นส. 02-1)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารผ่านรายการ',
      formId: ''
    },
    {
      id: 'ns022',
      title: 'นำส่งเงินแบบพักรายการ (นส. 02-2)',
      description: 'ค้นหารายงานข้อมูลการนำส่งเงินสำหรับเอกสารพักรายการ',
      formId: ''
    }
  ];

  public REPORT_DOC_TYPE = [{ id: 'd', name: 'รายวัน' }, { id: 'w', name: 'รายสัปดาห์' }, { id: 'm', name: 'รายเดือน' }];

  public TYPE_ACCOUNT_BC22 = [
    { id: '1101010103', account: '1101010103', name: 'บัตรภาษี' },
    { id: '4308010107', account: '4308010107', name: 'TR โอนบัตรภาษี' },
    { id: '5210010107', account: '5210010107', name: 'TE โอนบัตรภาษีแผ่นดิน' }
  ];
}
